import sys
import os
from collections import namedtuple
from typing import NamedTuple

sys.path.append(os.path.abspath(os.path.dirname(__file__) + '/../..'))

from analysis_utils.ys_timestamps import Ys_Timestamp, print_timestamps_summary, print_avg_min_max, null_timestamp

timestamp_dict = {
    "BXYA6741": ["00:00:02.983", "00:00:04.652", "00:00:22.172", "00:00:22.672", "00:00:22.838", null_timestamp, "00:00:23.305"],
    "CEYO1289": ["00:00:02.833", "00:00:04.502", "00:00:22.622", "00:00:22.622", "00:00:23.705", "00:00:24.205", "00:00:24.222"],
    "DOTD9311": ["00:00:04.018", "00:00:05.685", "00:00:23.422", "00:00:23.772", "00:00:24.188", null_timestamp, "00:00:24.605"],
    "DROF0047": ["00:00:03.200", "00:00:04.885", "00:00:22.938", "00:00:22.938", "00:00:24.122", null_timestamp, "00:00:24.188"],
    "GFRR2702": ["00:00:01.717", "00:00:03.367", "00:00:21.455", "00:00:21.455", "00:00:22.688", null_timestamp, "00:00:22.988"],
    "GIUR9676": ["00:00:01.800", "00:00:03.483", "00:00:20.988", "00:00:21.555", "00:00:21.705", null_timestamp, "00:00:22.205"],
    "GKWY5652": ["00:00:03.350", "00:00:05.018", "00:00:22.555", "00:00:23.072", "00:00:23.238", null_timestamp, "00:00:23.822"],
    "GUDP4771": ["00:00:03.017", "00:00:04.702", "00:00:22.255", "00:00:22.738", "00:00:23.005", null_timestamp, "00:00:23.488"],
    "GYTP3799": ["00:00:01.800", "00:00:03.500", "00:00:21.105", "00:00:21.505", "00:00:21.872", null_timestamp, "00:00:22.138"],
    "IKVK0400": ["00:00:01.450", "00:00:03.133", "00:00:20.655", "00:00:21.188", "00:00:21.505", null_timestamp, "00:00:21.838"],
    "JHGA3141": ["00:00:03.433", "00:00:05.102", "00:00:22.705", "00:00:23.188", "00:00:23.572", null_timestamp, "00:00:23.922"],
    "JMSI8634": ["00:00:03.233", "00:00:04.918", "00:00:22.905", "00:00:22.905", "00:00:23.805", null_timestamp, "00:00:23.922"],
    "JQLF7664": ["00:00:03.450", "00:00:05.135", "00:00:22.772", "00:00:23.188", "00:00:23.855", null_timestamp, "00:00:23.922"],
    "JXTU7942": ["00:00:02.850", "00:00:04.518", "00:00:22.555", "00:00:22.555", "00:00:23.738", null_timestamp, "00:00:24.305"],
    "KOHQ0557": ["00:00:03.167", "00:00:04.835", "00:00:22.572", "00:00:22.872", "00:00:23.005", null_timestamp, "00:00:23.705"],
    "MUGK1943": ["00:00:04.252", "00:00:05.918", "00:00:23.738", "00:00:23.972", "00:00:24.838", null_timestamp, "00:00:24.822"],
    "MVAO1903": ["00:00:03.300", "00:00:04.968", "00:00:22.722", "00:00:22.972", "00:00:23.288", null_timestamp, "00:00:23.705"],
    "NFEL7649": ["00:00:03.333", "00:00:05.018", "00:00:23.105", "00:00:23.105", "00:00:24.405", null_timestamp, "00:00:24.638"],
    "OZDL8277": ["00:00:02.733", "00:00:04.402", "00:00:21.772", "00:00:22.572", "00:00:22.772", null_timestamp, "00:00:23.088"],
    "SSDX8244": ["00:00:03.217", "00:00:04.885", "00:00:22.355", "00:00:22.988", null_timestamp, null_timestamp, "00:00:23.622"],
    "TKMT1218": ["00:00:01.517", "00:00:03.200", "00:00:21.255", "00:00:21.255", "00:00:21.338", null_timestamp, "00:00:22.305"],
    "TLXX5651": ["00:00:00.833", "00:00:02.500", "00:00:20.122", "00:00:20.538", "00:00:21.072", null_timestamp, "00:00:21.238"],
    "TTNQ7916": ["00:00:03.667", "00:00:05.368", "00:00:22.972", "00:00:23.355", "00:00:23.505", null_timestamp, "00:00:23.988"],
    "UHXY7579": ["00:00:01.333", "00:00:03.017", "00:00:20.738", "00:00:21.088", "00:00:21.688", null_timestamp, "00:00:21.738"],
    "UUTX6005": ["00:00:03.300", "00:00:04.968", "00:00:22.472", "00:00:22.988", "00:00:23.088", null_timestamp, "00:00:23.722"],
    "UUYJ5590": ["00:00:03.867", "00:00:05.535", "00:00:23.655", "00:00:23.655", "00:00:24.638", null_timestamp, "00:00:25.272"],
    "WBQW6016": ["00:00:01.400", "00:00:03.083", "00:00:20.588", "00:00:21.088", "00:00:21.355", null_timestamp, "00:00:21.722"],
    "XQYH8281": ["00:00:03.417", "00:00:05.068", "00:00:22.422", "00:00:23.205", null_timestamp, null_timestamp, "00:00:23.755"],
    "YKOA2777": ["00:00:02.950", "00:00:04.585", "00:00:22.655", "00:00:22.655", "00:00:23.555", null_timestamp, "00:00:23.888"]
}

class Video_Timestamps(NamedTuple):
    q_anim_start: Ys_Timestamp
    q_damage: Ys_Timestamp
    frame_disappear: Ys_Timestamp
    pao_pao_disappear: Ys_Timestamp
    last_bonused_hit: Ys_Timestamp
    first_unbonused_hit: Ys_Timestamp
    hp_restore: Ys_Timestamp


def get_intervals(ys_timestamp_dict: dict[str, Video_Timestamps]):
    intervals_dict = {}
    for filename, t in ys_timestamp_dict.items():
        intervals_dict[filename] = {
            "Q动画开始- Q出伤": t.q_damage - t.q_anim_start,
            "Q动画开始 - 边框消失": t.frame_disappear - t.q_anim_start,
            "边框消失 - 泡泡消失": t.pao_pao_disappear - t.frame_disappear,
            "Q动画开始 - 泡泡消失": t.pao_pao_disappear - t.q_anim_start,
            "泡泡消失 - 最后一次增伤命中": t.last_bonused_hit - t.pao_pao_disappear,
            "泡泡消失 - 生命值上限重置": t.hp_restore - t.pao_pao_disappear,
            "Q动画开始 - 生命值上限重置": t.hp_restore - t.q_anim_start,
        }
    
    return intervals_dict

sorted_intervals = print_timestamps_summary(Video_Timestamps, timestamp_dict, get_intervals)