from typing import NamedTuple
import sys
import os

sys.path.append(os.path.abspath('../'))

from analysis_utils.ys_timestamps import Ys_Timestamp, print_timestamps_summary, null_timestamp, range_print_func


timestamp_dict = {
    "AIEN2759": ["00:00:05.702", "00:00:06.902", "00:00:07.168", "00:00:07.168", "00:00:07.252",
                 ["00:00:08.052", "00:00:08.118", "00:00:08.118", null_timestamp],
                 ["00:00:10.018", "00:00:10.085", "00:00:10.085", "00:00:10.185"],
                 ["00:00:12.003", "00:00:12.070", "00:00:12.087", "00:00:12.137"],
                 ["00:00:13.970", "00:00:14.153", "00:00:14.153", null_timestamp],
                 ["00:00:15.937", "00:00:15.987", "00:00:16.003", "00:00:16.087"],
                 null_timestamp, null_timestamp],
    "BFGL6588": ["00:00:02.750", "00:00:03.950", "00:00:04.218", "00:00:04.235", "00:00:04.285",
                 ["00:00:05.102", "00:00:05.168", "00:00:05.168", null_timestamp],
                 ["00:00:07.068", "00:00:07.152", "00:00:07.152", null_timestamp],
                 # 怪头上没元素，因此先扩散，然后染伤，给怪挂上了冰
                 ["00:00:09.052", "00:00:09.218", "00:00:09.218", null_timestamp],
                 ["00:00:11.035", "00:00:11.102", "00:00:11.102", "00:00:11.202"],
                 ["00:00:13.020", "00:00:13.120", "00:00:13.120", "00:00:13.337"],
                 "00:00:22.905", "00:00:23.155"],
    "DAKA3706": ["00:00:07.435", "00:00:08.635", "00:00:08.902", "00:00:08.918", "00:00:09.002",
                 ["00:00:09.868", "00:00:10.002", "00:00:10.002", null_timestamp],
                 ["00:00:11.868", "00:00:11.985", "00:00:11.985", "00:00:12.002"],
                 ["00:00:13.870", "00:00:13.937", "00:00:13.937", "00:00:14.003"],
                 ["00:00:15.837", "00:00:16.020", "00:00:16.020", null_timestamp],
                 ["00:00:17.820", "00:00:17.887", "00:00:17.903", "00:00:17.937"],
                 null_timestamp, null_timestamp],
    "DNDK6459": ["00:00:07.268", "00:00:08.468", "00:00:08.718", "00:00:08.735", "00:00:08.835",
                 ["00:00:09.702", "00:00:09.802", "00:00:09.802", null_timestamp],
                 ["00:00:11.702", "00:00:11.785", "00:00:11.785", null_timestamp],
                 ["00:00:13.703", "00:00:13.820", "00:00:13.820", "00:00:13.820"],
                 ["00:00:15.670", "00:00:15.737", "00:00:15.737", "00:00:15.787"],
                 ["00:00:17.653", "00:00:17.703", "00:00:17.720", null_timestamp],
                 null_timestamp, null_timestamp],
    "DRIF5395": ["00:00:08.768", "00:00:09.968", "00:00:10.235", "00:00:10.235", "00:00:10.335",
                 ["00:00:11.118", "00:00:11.252", "00:00:11.252", null_timestamp],
                 ["00:00:13.120", "00:00:13.187", "00:00:13.187", "00:00:13.287"],
                 ["00:00:15.120", "00:00:15.170", "00:00:15.170", "00:00:15.237"],
                 ["00:00:17.153", "00:00:17.203", "00:00:17.203", null_timestamp],
                 ["00:00:19.137", "00:00:19.220", "00:00:19.220", null_timestamp],
                 "00:00:24.905", "00:00:25.172"],
    "FBOK5430": ["00:00:01.050", "00:00:02.250", "00:00:02.517", "00:00:02.517", "00:00:02.600",
                 ["00:00:03.467", "00:00:03.600", "00:00:03.600", null_timestamp],
                 ["00:00:05.452", "00:00:05.518", "00:00:05.518", "00:00:05.618"],
                 ["00:00:07.435", "00:00:07.502", "00:00:07.502", "00:00:07.568"],
                 ["00:00:09.418", "00:00:09.585", "00:00:09.585", null_timestamp],
                 ["00:00:11.385", "00:00:11.452", "00:00:11.452", "00:00:11.518"],
                 null_timestamp, null_timestamp],
    "FYWQ4534": ["00:00:06.252", "00:00:07.452", "00:00:07.718", "00:00:07.768", "00:00:07.802",
                 ["00:00:08.652", "00:00:08.702", "00:00:08.702", null_timestamp],
                 ["00:00:10.618", "00:00:10.702", "00:00:10.702", null_timestamp],
                 ["00:00:12.587", "00:00:12.670", "00:00:12.670", null_timestamp],
                 ["00:00:14.570", "00:00:14.637", "00:00:14.637", null_timestamp],
                 ["00:00:16.537", "00:00:16.620", "00:00:16.620", null_timestamp],
                 null_timestamp, null_timestamp],
    "LBCD3882": ["00:00:07.418", "00:00:08.618", "00:00:08.868", "00:00:08.968", "00:00:08.985",
                 ["00:00:09.835", "00:00:09.885", "00:00:09.885", null_timestamp],
                 ["00:00:11.835", "00:00:11.952", "00:00:11.952", null_timestamp],
                 ["00:00:13.803", "00:00:14.037", "00:00:14.037", null_timestamp],
                 ["00:00:15.770", "00:00:15.820", "00:00:15.837", "00:00:15.887"],
                 ["00:00:17.737", "00:00:17.803", "00:00:17.803", null_timestamp],
                 null_timestamp, null_timestamp],
    "LGDD9255": ["00:00:06.952", "00:00:08.152", "00:00:08.452", "00:00:08.452", "00:00:08.502",
                 ["00:00:09.302", "00:00:09.368", "00:00:09.385", null_timestamp],
                 ["00:00:11.302", "00:00:11.418", "00:00:11.418", null_timestamp],
                 ["00:00:13.303", "00:00:13.370", "00:00:13.370", null_timestamp],
                 ["00:00:15.303", "00:00:15.420", "00:00:15.420", null_timestamp],
                 ["00:00:17.303", "00:00:17.387", "00:00:17.387", null_timestamp],
                 null_timestamp, null_timestamp],
    "MGUL4587": ["00:00:10.518", "00:00:11.718", "00:00:11.935", "00:00:12.035", "00:00:12.085",
                 ["00:00:12.920", "00:00:13.037", "00:00:13.037", null_timestamp],
                 ["00:00:14.887", "00:00:14.953", "00:00:14.953", "00:00:15.053"],
                 ["00:00:16.853", "00:00:16.920", "00:00:16.937", "00:00:16.987"],
                 ["00:00:18.820", "00:00:18.887", "00:00:18.887", null_timestamp],
                 ["00:00:20.805", "00:00:20.888", "00:00:20.888", null_timestamp],
                 "00:00:26.772", "00:00:27.022"],
    "SEOI3291": ["00:00:06.568", "00:00:07.768", "00:00:08.035", "00:00:08.118", "00:00:08.135",
                 ["00:00:08.902", "00:00:08.968", "00:00:08.968", null_timestamp],
                 ["00:00:10.885", "00:00:10.952", "00:00:10.952", "00:00:11.052"],
                 ["00:00:12.903", "00:00:12.970", "00:00:12.970", "00:00:13.070"],
                 ["00:00:14.903", "00:00:14.970", "00:00:14.970", "00:00:15.070"],
                 ["00:00:16.903", "00:00:16.970", "00:00:16.970", "00:00:17.053"],
                 null_timestamp, null_timestamp],
    "TMRF2700": ["00:00:06.568", "00:00:07.768", "00:00:08.002", "00:00:08.085", "00:00:08.118",
                 ["00:00:08.968", "00:00:09.102", "00:00:09.102", null_timestamp],
                 ["00:00:10.935", "00:00:10.985", "00:00:10.985", "00:00:11.085"],
                 ["00:00:12.920", "00:00:13.020", "00:00:13.020", "00:00:13.120"],
                 ["00:00:14.903", "00:00:14.970", "00:00:14.987", "00:00:15.020"],
                 ["00:00:16.887", "00:00:16.970", "00:00:16.970", null_timestamp],
                 null_timestamp, null_timestamp],
    "XXMH8962": ["00:00:08.735", "00:00:09.935", "00:00:10.152", "00:00:10.252", "00:00:10.302",
                 # 因为上面已经扩散了一次，怪身上无元素附着，因此第一次流风是先造成风伤，后染伤(冰)，给怪挂上了冰元素
                 ["00:00:11.118", "00:00:11.252", "00:00:11.252", null_timestamp],
                 ["00:00:13.120", "00:00:13.237", "00:00:13.237", "00:00:13.303"],
                 # 15.120这次，怪附着有冰，所以先染伤(15.187)，再风伤(15.203)
                 # 但这里有个问题：扩散两个字在 15.137 就出来了，几乎和命中同时
                 # 扩散的冰碰到了掣电树的电头，触发超导(16.187)
                 # 更准确的过程可能是：染色的冰伤和电头反应，触发超导，造成冰伤(15.187)
                 # 虽然在这之后怪身上没有元素附着了，但应该有一些冰残留，然后风扩散了这些残留的冰
                 ["00:00:15.120", "00:00:15.187", "00:00:15.203", "00:00:15.237"],
                 # 怪身上无元素，所以先造成风伤，后造成冰伤，冰伤触发超导，怪身上无冰残留
                 ["00:00:17.120", "00:00:17.237", "00:00:17.237", null_timestamp],
                 ["00:00:19.137", "00:00:19.253", "00:00:19.253", null_timestamp],
                 "00:00:25.122", "00:00:25.372"],
    "XZKZ1494": ["00:00:06.618", "00:00:07.818", "00:00:08.052", "00:00:08.152", "00:00:08.168",
                 ["00:00:09.002", "00:00:09.068", "00:00:09.068", null_timestamp],
                 ["00:00:10.985", "00:00:11.085", "00:00:11.085", null_timestamp],
                 ["00:00:12.970", "00:00:13.037", "00:00:13.037", null_timestamp],
                 ["00:00:14.937", "00:00:15.003", "00:00:15.003", null_timestamp],
                 ["00:00:16.920", "00:00:16.987", "00:00:16.987", null_timestamp],
                 null_timestamp, null_timestamp],
}


class Video_Timestamps(NamedTuple):
    q_start: Ys_Timestamp
    q_hit: Ys_Timestamp
    q_feng_damage: Ys_Timestamp
    q_kuo_san_damage: Ys_Timestamp
    q_end: Ys_Timestamp

    liu_feng_first: list[Ys_Timestamp]   # hit, bing_damage, feng_damage, kuo_san_damage
    liu_feng_2nd: list[Ys_Timestamp]
    liu_feng_3rd: list[Ys_Timestamp]
    liu_feng_4th: list[Ys_Timestamp]
    liu_feng_5th: list[Ys_Timestamp]

    ling_hua_last_bonused: Ys_Timestamp
    ling_hua_first_unbonused: Ys_Timestamp


def get_intervals(ys_timestamp_dict: dict[str, Video_Timestamps]):
    intervals_dict = {}
    for name, t in ys_timestamp_dict.items():
        liu_feng = [t.liu_feng_first, t.liu_feng_2nd,  t.liu_feng_3rd, t.liu_feng_4th, t.liu_feng_5th]
        last_kuo_san = None
        for idx in [4, 3, 2, 1, 0]:
            if liu_feng[idx][-1] is not null_timestamp:
                last_kuo_san = liu_feng[idx][0]
                break

        if not last_kuo_san:
            last_kuo_san = t.q_hit

        last_bonused = t.ling_hua_last_bonused - last_kuo_san
        if last_bonused:
            last_bonused = round(last_bonused + 0.001, 3)

        intervals_dict[name] = {
            "Q动画开始 - Q动画结束": t.q_end - t.q_start,
            "Q动画开始 - Q命中": t.q_hit - t.q_start,
            "Q命中 - Q风伤": t.q_feng_damage - t.q_hit,
            "Q命中 - 扩散伤害": t.q_kuo_san_damage - t.q_hit,

            "Q动画开始 - 第一次流风开始": t.liu_feng_first[0] - t.q_start,
            "流风间隔": [
                t.liu_feng_2nd[0] - t.liu_feng_first[0],
                t.liu_feng_3rd[0] - t.liu_feng_2nd[0],
                t.liu_feng_4th[0] - t.liu_feng_3rd[0],
                t.liu_feng_5th[0] - t.liu_feng_4th[0]
            ],
            "第一次流风 - 最后一次流风": t.liu_feng_5th[0] - t.liu_feng_first[0],
            "Q动画结束 - 最后一次流风": t.liu_feng_5th[0] - t.q_end,
            "流风减抗持续时间": (last_bonused, t.ling_hua_first_unbonused - last_kuo_san)
        }

    return intervals_dict


print_timestamps_summary(Video_Timestamps, timestamp_dict, get_intervals,
                         description_print_func={"流风减抗持续时间": range_print_func})


timestamps_dict2 = {
    "ALUG6642": ["00:00:02.533", "00:00:03.733", "00:00:03.950", "00:00:04.018", "00:00:04.085", "00:00:13.737", "00:00:13.987"],
    "ANJH0223": ["00:00:04.385", "00:00:05.585", "00:00:05.802", "00:00:05.852", "00:00:05.952", "00:00:15.720", "00:00:15.970"],
    "DOAR0004": ["00:00:02.567", "00:00:03.767", "00:00:03.983", "00:00:04.035", "00:00:04.118", "00:00:13.720", "00:00:13.970"],
    "DZUW3580": ["00:00:06.843", "00:00:08.043", "00:00:08.277", "00:00:08.327", "00:00:08.393", "00:00:18.162", "00:00:18.412"],
    "OFHD8015": ["00:00:02.967", "00:00:04.168", "00:00:04.385", "00:00:04.435", "00:00:04.535", "00:00:14.153", "00:00:14.403"],
    "PYEM5482": ["00:00:05.252", "00:00:06.452", "00:00:06.685", "00:00:06.718", "00:00:06.802", "00:00:16.620", "00:00:16.870"],
    "QFMS1729": ["00:00:06.718", "00:00:07.918", "00:00:08.135", "00:00:08.218", "00:00:08.268", "00:00:17.887", "00:00:18.137"],
    "RDXF8588": ["00:00:09.102", "00:00:10.302", "00:00:10.518", "00:00:10.568", "00:00:10.652", "00:00:20.455", "00:00:20.722"],
    "RODA2772": ["00:00:05.818", "00:00:07.018", "00:00:07.235", "00:00:07.285", "00:00:07.385", "00:00:16.987", "00:00:17.237"],
    "UYYO0728": ["00:00:04.685", "00:00:05.885", "00:00:06.102", "00:00:06.168", "00:00:06.235", "00:00:15.953", "00:00:16.203"],
    "VFZI2953": ["00:00:05.618", "00:00:06.818", "00:00:07.035", "00:00:07.085", "00:00:07.168", "00:00:17.020", "00:00:17.270"],
}


class Video_Timestamps2(NamedTuple):
    q_anim_start: Ys_Timestamp
    q_hit: Ys_Timestamp
    q_feng_damage: Ys_Timestamp
    kuo_san_damage: Ys_Timestamp
    q_anim_end: Ys_Timestamp
    ling_hua_last_jian_kang_hit: Ys_Timestamp
    ling_hua_first_non_jian_kang_hit: Ys_Timestamp


def get_intervals2(ys_timestamp_dict: dict[str, Video_Timestamps2]):
    intervals_dict = {}
    for name, t in ys_timestamp_dict.items():
        intervals_dict[name] = {
            "Q动画开始 - Q扩散": t.kuo_san_damage - t.q_anim_start,
            "Q动画开始 - Q命中": t.q_hit - t.q_anim_start,
            "Q命中 - Q风伤": t.q_feng_damage - t.q_hit,
            "Q风伤 - Q扩散": t.kuo_san_damage - t.q_feng_damage,
            "Q动画开始 - 减抗消失": (round(t.ling_hua_last_jian_kang_hit - t.q_anim_start + 0.01, 3),
                             t.ling_hua_first_non_jian_kang_hit - t.q_anim_start),
            "Q命中 - 减抗消失": (round(t.ling_hua_last_jian_kang_hit - t.q_hit + 0.01, 3),
                           t.ling_hua_first_non_jian_kang_hit - t.q_hit),
        }

    return intervals_dict

print("==============================")

print_timestamps_summary(Video_Timestamps2, timestamps_dict2, get_intervals2,
                         description_print_func={"Q动画开始 - 减抗消失": range_print_func,
                                                 "Q命中 - 减抗消失": range_print_func})
